benchmarks/results-proxy-50000-10.log
====== PING (inline) ======
  50000 requests completed in 4.32 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.89% <= 1 milliseconds
99.88% <= 2 milliseconds
99.96% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 5 milliseconds
11576.75 requests per second

====== PING ======
  50000 requests completed in 4.17 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

88.16% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
11990.41 requests per second

====== MSET (10 keys) ======
  50000 requests completed in 4.62 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

84.26% <= 1 milliseconds
99.77% <= 2 milliseconds
99.78% <= 3 milliseconds
99.80% <= 4 milliseconds
99.93% <= 5 milliseconds
99.98% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
10820.17 requests per second

====== SET ======
  50000 requests completed in 4.25 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.40% <= 1 milliseconds
99.96% <= 2 milliseconds
99.96% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
11767.47 requests per second

====== GET ======
  50000 requests completed in 4.20 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

88.18% <= 1 milliseconds
99.98% <= 2 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
11904.76 requests per second

====== INCR ======
  50000 requests completed in 4.27 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.36% <= 1 milliseconds
99.96% <= 2 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
11709.60 requests per second

====== LPUSH ======
  50000 requests completed in 4.37 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.59% <= 1 milliseconds
99.95% <= 2 milliseconds
99.96% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
11436.41 requests per second

====== LPOP ======
  50000 requests completed in 4.69 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

83.47% <= 1 milliseconds
99.39% <= 2 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
10656.44 requests per second

====== SADD ======
  50000 requests completed in 4.58 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.43% <= 1 milliseconds
99.91% <= 2 milliseconds
99.96% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
10924.19 requests per second

====== SPOP ======
  50000 requests completed in 4.50 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.90% <= 1 milliseconds
99.98% <= 2 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
11108.64 requests per second

====== LPUSH (again, in order to bench LRANGE) ======
  50000 requests completed in 4.58 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.74% <= 1 milliseconds
99.98% <= 2 milliseconds
99.98% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
10909.88 requests per second

====== LRANGE (first 100 elements) ======
  50000 requests completed in 4.68 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

87.40% <= 1 milliseconds
99.68% <= 2 milliseconds
99.70% <= 5 milliseconds
99.93% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
10674.64 requests per second

====== LRANGE (first 300 elements) ======
  50000 requests completed in 5.22 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

77.76% <= 1 milliseconds
98.52% <= 2 milliseconds
99.48% <= 5 milliseconds
99.78% <= 6 milliseconds
99.97% <= 7 milliseconds
100.00% <= 7 milliseconds
9573.04 requests per second

====== LRANGE (first 450 elements) ======
  50000 requests completed in 5.63 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

67.20% <= 1 milliseconds
97.25% <= 2 milliseconds
99.28% <= 3 milliseconds
99.30% <= 5 milliseconds
99.67% <= 6 milliseconds
99.95% <= 7 milliseconds
100.00% <= 7 milliseconds
8876.26 requests per second

====== LRANGE (first 600 elements) ======
  50000 requests completed in 6.51 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

52.62% <= 1 milliseconds
93.24% <= 2 milliseconds
98.80% <= 3 milliseconds
98.81% <= 4 milliseconds
99.26% <= 5 milliseconds
99.56% <= 6 milliseconds
99.62% <= 7 milliseconds
99.62% <= 8 milliseconds
99.65% <= 9 milliseconds
99.71% <= 10 milliseconds
99.86% <= 11 milliseconds
99.93% <= 12 milliseconds
99.97% <= 13 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
7675.78 requests per second