benchmarks/results-straight-50000-10.log
====== PING (inline) ======
  50000 requests completed in 0.94 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 1 milliseconds
53134.96 requests per second

====== PING ======
  50000 requests completed in 0.96 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
52029.14 requests per second

====== MSET (10 keys) ======
  50000 requests completed in 1.60 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.96% <= 1 milliseconds
100.00% <= 1 milliseconds
31191.52 requests per second

====== SET ======
  50000 requests completed in 1.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
48732.94 requests per second

====== GET ======
  50000 requests completed in 0.96 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
52192.07 requests per second

====== INCR ======
  50000 requests completed in 1.07 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
46728.97 requests per second

====== LPUSH ======
  50000 requests completed in 1.05 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
47664.44 requests per second

====== LPOP ======
  50000 requests completed in 1.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.96% <= 1 milliseconds
100.00% <= 1 milliseconds
48971.59 requests per second

====== SADD ======
  50000 requests completed in 1.04 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
48216.01 requests per second

====== SPOP ======
  50000 requests completed in 0.98 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
50968.40 requests per second

====== LPUSH (again, in order to bench LRANGE) ======
  50000 requests completed in 1.04 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
48123.20 requests per second

====== LRANGE (first 100 elements) ======
  50000 requests completed in 1.28 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
39001.56 requests per second

====== LRANGE (first 300 elements) ======
  50000 requests completed in 1.65 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
30321.41 requests per second

====== LRANGE (first 450 elements) ======
  50000 requests completed in 2.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.98% <= 1 milliseconds
100.00% <= 1 milliseconds
24654.83 requests per second

====== LRANGE (first 600 elements) ======
  50000 requests completed in 2.48 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.96% <= 1 milliseconds
100.00% <= 1 milliseconds
20185.71 requests per second